/*
=====================================================
初期データ登録SQL

勤怠管理システム

最初にログイン確認を行うための
ユーザーを登録する。
=====================================================
*/


/*
=====================================================
users 初期データ
=====================================================
*/

INSERT INTO users (

    employee_number,
    name,
    password,
    role

)
VALUES

(
    'ADMIN001',
    '管理者',
    'admin123',
    'ADMIN'
),

(
    'USER001',
    '森',
    'user123',
    'USER'
),

(
    'USER002',
    '庄山',
    'user123',
    'USER'
);